tests/pure_openfoam_cases/phill/sim_turb/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0001;

boundaryField

{
    outlet
    {
        type            cyclic;
    }

    inlet
    {
        type            cyclic;
    }

    bottom
    {
	    type            kqRWallFunction;
        value           $internalField;
    }

    top
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    frontandbackplanes
    {
	    type		    empty;
    }
}
