tests/pure_openfoam_cases/phill/sim_turb/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField

{
    outlet
    {
        type            cyclic;
    }

    inlet
    {
        type            cyclic;
    }

    bottom
    {
	    type            nutkWallFunction;
        value           uniform 0;
    }

    top
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    frontandbackplanes
    {
	    type		    empty;
    }

}
