tests/pure_openfoam_cases/phill/sim_turb/0/rhok
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      rhok;
}

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
32500
(
1.14998
1.14998
1.14998
1.14998
1.14998
1.14998
1.14998
1.14998
...
)
;

boundaryField
{
    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    outlet
    {
        type            cyclic;
    }

    inlet
    {
        type            cyclic;
    }

    frontandbackplanes
    {
        type            empty;
    }
}
