tests/pure_openfoam_cases/phill/sim_turb/constant/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}

momentumSource
{
    type            meanVelocityForce;
    active          yes;

    meanVelocityForceCoeffs
    {
        selectionMode   all;
        fields          (U);
        Ubar            (1.0 0 0);
    }
}
