tests/pure_openfoam_cases/phill/sim_turb/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel Newtonian;

nu            nu  [0 2 -1 0 0 0 0] 0.000002;

Pr            Pr [0 0 0 0 0 0 0] 1;

Prt           Prt  [0 0 0 0 0 0 0] 0.85;
