tests/pure_openfoam_cases/phill/sim_turb/system/funkySetFieldsDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

expressions
(
    grad_inv_rhok
    {
        variables
        (
            "rho0=1.15;"
            "height=1;"
            "delta_rho=-0.141;"
        );

        field rhok;
        value uniform 1.15;
        expression "rho0 + pos().y / height * delta_rho";
        keepPatches 1;
    }
);
